ART-Badge/SDK/bsp_for_art-badge/libraries/src/mcu/rtl876x/system_rtl876x.c
    memset(Image$$CACHE_DATA_ON$$ZI$$Base,
           0,
           (unsigned int)&Image$$CACHE_DATA_ON$$ZI$$Length);
#elif defined ( __GNUC__   )
    //copy share cache ram rw
    extern uint32_t *__cache_dataon_start__;
    extern uint32_t *__cache_data_load_ad__;
    extern uint32_t *__cache_dataon_length__;

    memcpy(&__cache_dataon_start__,
           &__cache_data_load_ad__,
           (unsigned int)&__cache_dataon_length__);
#endif
}

#ifdef SUPPORT_ALONE_UPPERSTACK_IMG
APP_FLASH_TEXT_SECTION
bool check_header_valid_imp(uint32_t header_addr, T_IMG_ID image_id)
{
    if (header_addr == 0)
    {
        return false;
    }

    T_IMG_CTRL_HEADER_FORMAT *header = (T_IMG_CTRL_HEADER_FORMAT *)header_addr;
    if (header->ic_type != DEFINED_IC_TYPE)
    {
        return false;
    }

    if (image_id > OTA && image_id < IMAGE_MAX)
    {
        char c_rom_uuid[16]  = DEFINE_rom_uuid;

        if (header->ctrl_flag.flag_value.not_ready
            || header->image_id != image_id)
        {
            return false;
        }

        if (0 == memcmp(((T_IMG_HEADER_FORMAT *)header)->uuid, c_rom_uuid, 16))
        {
            return true;
        }
    }

    return false;
}

APP_FLASH_TEXT_SECTION
uint32_t get_header_addr_by_img_id_imp(T_IMG_ID image_id)
{
    uint32_t image_addr = 0;

    if (image_id <= OTA || image_id >= IMAGE_MAX)
    {
        return image_addr;
    }

    uint32_t ota_header_addr = get_active_ota_bank_addr();

    if (!check_header_valid(ota_header_addr, OTA))
    {
        return image_addr;
    }

    T_OTA_HEADER_FORMAT *ota_header = (T_OTA_HEADER_FORMAT *)ota_header_addr; //ota_header_addr

    image_addr = HAL_READ32((uint32_t)&ota_header->secure_boot_addr, (image_id - SecureBoot) * 8);
    if (image_addr == 0)
    {
        return image_addr;
    }
    else
    {
        return (image_addr | FLASH_OFFSET_TO_NO_CACHE);
    }
}

APP_FLASH_TEXT_SECTION
APP_MAIN_FUNC get_image_entry_addr(uint16_t image_id)
{

    uint32_t active_ota_bank_addr =  get_active_ota_bank_addr();
    if (!check_header_valid(active_ota_bank_addr, OTA))
    {
        return NULL;
    }

    T_OTA_HEADER_FORMAT *ota_header = (T_OTA_HEADER_FORMAT *)active_ota_bank_addr;
    uint32_t image_size =
        HAL_READ32((uint32_t)&ota_header->secure_boot_size, (image_id - SecureBoot) * 8);

    if (image_size == 0)
    {
        return NULL;
    }

    uint32_t header_addr = get_header_addr_by_img_id_imp((T_IMG_ID)image_id);

    if (!check_header_valid_imp(header_addr, (T_IMG_ID)image_id))
    {
        /*if header_addr=0, will return here*/
        return NULL;
    }

    T_IMG_HEADER_FORMAT *header = (T_IMG_HEADER_FORMAT *)header_addr;

    if (header->ctrl_header.image_id != image_id || image_id >= IMAGE_MAX)
    {
        return NULL;
    }

    APP_MAIN_FUNC entry_func = (APP_MAIN_FUNC)(header->exe_base | 1);

    return entry_func;
}

#else
bool check_upperstack_img(void) APP_FLASH_TEXT_SECTION;
bool check_upperstack_img(void)
{
#if   defined ( __CC_ARM ) || defined (__ICCARM__)
    T_UPPERSTACK_HEADER *p_header = (T_UPPERSTACK_HEADER *)UPPERSTACK_FLASH_ADDR;
#elif defined ( __GNUC__ )
    extern uint32_t *__upperstack_flash_start_load_ad__;
    T_UPPERSTACK_HEADER *p_header = (T_UPPERSTACK_HEADER *)&__upperstack_flash_start_load_ad__;
#endif
    if (DEFINED_IC_TYPE != p_header->ic_type)
    {
        return false;
    }

    if (UPPERSTACK_GLOBAL_SIZE < p_header->ram_size)
    {
        return false;
    }

    return (((uint32_t)&upperstack_fake_data) == p_header->check_ver_pattern)
           && (((uint32_t)&upperstack_level_fake_data) == p_header->check_level_pattern);
}
#endif

#if defined ( __ICCARM__ )
#if FEATURE_ENCRYPTION
void SystemInit(void) APP_ENCRYPTION_TEXT_SECTION;
#else
void SystemInit(void) APP_FLASH_TEXT_SECTION;
#endif
#else
void SystemInit(void) APP_FLASH_TEXT_SECTION;
#endif

void SystemInit(void)
{
    //hci mode check and bypass app
    if (check_hci_mode_flag() || (OTP->stack_en == 0))
    {
        return;
    }

#ifndef SUPPORT_ALONE_UPPERSTACK_IMG
    if (!check_upperstack_img())
    {
        extern void LOGUARTDriverInit(void);
        LOGUARTDriverInit();
        DBG_DIRECT("upperstack img doesn't match the symbol!");
        return;
    }
#endif

    //init pre_main and main functions
    app_pre_main = (APP_MAIN_FUNC)pre_main;

#ifdef SUPPORT_ALONE_UPPERSTACK_IMG
    upperstack_entry = get_image_entry_addr(UpperStack);
#else
    upperstack_entry = (APP_MAIN_FUNC)upperstack_loader;
#endif
    app_main = (APP_MAIN_FUNC)common_main;

    app_cb_wdg_reset = (APP_CB_WDG_RESET_TYPE)wdg_system_reset_app_cb;

    /******** update otp here**********/
    //ram config
    OTP->appDataAddr = APP_GLOBAL_ADDR;
    OTP->appDataSize = APP_GLOBAL_SIZE;
    OTP->heapDataONSize = HEAP_DATA_ON_SIZE;

    /* not share: SHARE_CACHE_RAM_0K; 8K: SHARE_CACHE_RAM_8K; 16K: SHARE_CACHE_RAM_16K */
#if ((16 * 1024) == SHARE_CACHE_RAM_SIZE)
    OTP->share_cache_ram_reg = SHARE_CACHE_RAM_16K;
#elif ((8 * 1024) == SHARE_CACHE_RAM_SIZE)
    OTP->share_cache_ram_reg = SHARE_CACHE_RAM_8K;
#else
    OTP->share_cache_ram_reg = SHARE_CACHE_RAM_0K;
#endif

#ifdef SUPPORT_SINGLE_BANK_OTA_USER_DATA
    OTP->bkp_data1_addr = USER_DATA_START_ADDR;
    OTP->bkp_data1_size = USER_DATA_MAX_SIZE;
#if (DISABLE_AES_OTA == 1)
    OTP->ota_with_encryption_data = 0;
#endif
#endif

#if (WRITE_HARDFAULT_RECORD_TO_FLASH_ENABLE > 0) && (SYSTEM_TRACE_ENABLE == 1) && (TRACE_HARDFAULT == 1)
    patch_hardfault_save_to_flash_init();
#endif

#if (WRITE_REASON_TO_FLASH_BEFORE_RESET_ENABLE > 0) && (SYSTEM_TRACE_ENABLE == 1) && (TRACE_WDG_TIMEOUT == 1)
    patch_wdg_timeout_reason_save_to_flash_init();
#endif

    //sw timer config
#ifdef TIMER_MAX_NUMBER
    //define TIMER_MAX_NUMBER in otp_config.h
    OTP->timerMaxNumber = TIMER_MAX_NUMBER;
#endif

    //flash config
    /*config enable flash block proect depending on flash layout and flash id*/
#if (FLASH_BLOCK_PROTECT_ENABLE == 1)
    OTP->bp_enable = 1;
#else
    OTP->bp_enable = 0;
#endif
    OTP->delay_10us_after_toggle_cs = AFTER_TOGGLE_CS_DELAY;

    //os config
    /*config enable check task stack overflow*/
#if (CHECK_STACK_OVERFLOW_ENABLE == 1)
    OTP->checkForStackOverflow = 1;
#else
    OTP->checkForStackOverflow = 0;
#endif


    //platform config
    /*config enable platform assert*/
#if (PLATFORM_ASSERT_ENABLE == 1)
    OTP->enableASSERT = 1;
#else
    OTP->enableASSERT = 0;
#endif

    /*Print all log in log buffer before entering DLPS */
#if (CHECK_LOG_BUFFER_BEFORE_DLPS_ENABLE == 1)
    OTP->printAllLogBeforeEnterDLPS = 1;
#else
    OTP->printAllLogBeforeEnterDLPS = 0;
#endif

    /*config enable log or not*/
#if (CONFIG_LOG_FUNCTION_ENABLE == 1)
    OTP->logDisable = 0;
#else
    OTP->logDisable = 1;
#endif

    /*before wdg system reset, write reset reason to specific flash addr*/
#if (WRITE_REASON_TO_FLASH_BEFORE_RESET_ENABLE > 0)
    OTP->write_reason_to_flash_before_reset = WRITE_REASON_TO_FLASH_BEFORE_RESET_ENABLE;
    OTP->reboot_reason_record_address = REBOOT_REASON_RECORD_ADDRESS;
    OTP->reboot_reason_record_limit_power_2 = REBOOT_REASON_RECORD_LIMIT_POWERT2;
#endif

    /*config enable swd pinmux*/
#if (SWD_PINMUX_ENABLE == 1)
    OTP->SWD_ENABLE = 1;
#else
    OTP->SWD_ENABLE = 0;
#endif

    /*config enable watch dog in rom*/
#if (ROM_WATCH_DOG_ENABLE == 1)
    OTP->wdgEnableInRom = 1;
#else
    OTP->wdgEnableInRom = 0;
#endif

    /*config watch dog mode in rom, defualt 4s timeout and reset all*/
#if (ROM_WATCH_DOG_ENABLE == 1)
    OTP->wdgConfigDivfactor = ROM_WATCH_DOG_CFG_DIV_FACTOR;
    OTP->wdgConfigCntLimit = ROM_WATCH_DOG_CFG_CNT_LIMIT;
    OTP->wdgMode = ROM_WATCH_DOG_MODE;
#endif

    /*config enable write hardfault record to flash*/
#if (ENABLE_WRITE_HARDFAULT_RECORD_TO_FLASH > 0)
    OTP->write_info_to_flash_when_hardfault = ENABLE_WRITE_HARDFAULT_RECORD_TO_FLASH;
    OTP->HardFault_Record_BegAddr = HARDFAULT_RECORD_BEG_ADDR;
    OTP->HardFault_Record_EndAddr = HARDFAULT_RECORD_END_ADDR;
    OTP->HardFault_Record_CFG = HARDFAULT_RECORD_CFG;
#endif

#if (ENABLE_FLASH_READ_TURN_OFF_RF > 0)
    OTP->read_turn_on_off_rf = ENABLE_FLASH_READ_TURN_OFF_RF;
#endif


    //app config
    OTP->ota_timeout_total = OTA_TIMEOUT_TOTAL;
    OTP->ota_timeout_wait4_conn = OTA_TIMEOUT_WAIT4_CONN;
    OTP->ota_timeout_wait4_image_transfer = OTA_TIMEOUT_WAIT4_IMAGE_TRANS;
    OTP->ota_timeout_ctittv = OTA_TIMEOUT_CTITTV;

#if ROM_OTA_LINKLOSS_RST
    OTP->ota_link_loss_reset = 1;
#endif


    /*config bt stack parameters in rom*/
#ifdef BT_STACK_CONFIG_ENABLE
    bt_stack_config_init();
#endif
#if defined ( __ICCARM__ )
    app_pre_main_cb = 0;
#endif
//add more otp config here

    ram_init();

    if (os_patch)
    {
        os_patch();
    }
}

void print_reset_reason(void) APP_FLASH_TEXT_SECTION;
void print_reset_reason(void)
{
    T_SW_RESET_REASON sw_reset_type = reset_reason_get();
    if (sw_reset_type == RESET_REASON_HW)
    {
        BOOT_PRINT_INFO0("RESET Reason: HW");
    }
    else
    {
        BOOT_PRINT_INFO1("RESET Reason: SW, TYPE 0x%x", sw_reset_type);
    }
}

void pre_main(void) APP_FLASH_TEXT_SECTION ;
void pre_main(void)
{
    __disable_irq();

    print_reset_reason();

