ART-Badge/SDK/bsp_for_art-badge/libraries/src/mcu/rtl876x/system_rtl876x.c
#if 0
#if (RETARGET_PRINTF_METHOD == 0)
int __2printf(const char *fmt, ...)
{
    return 0;
}
#endif

void *malloc(size_t size)
{
    return os_mem_alloc(RAM_TYPE_DATA_ON, size);
}

void *calloc(size_t n, size_t size)
{
    return os_mem_zalloc(RAM_TYPE_DATA_ON, n * size);
}

void *realloc(void *ptr, size_t size)
{
    if (ptr)
    {
        os_mem_free(ptr);
    }

    return os_mem_alloc(RAM_TYPE_DATA_ON, size);
}

void free(void *ptr)
{
    os_mem_free(ptr);
}
#endif

/**
 * @brief  get cpu clock
 * @param  none
 * @return uint32, for example 40000000 is 40M, 20000000 is 20M.
  */
uint32_t get_cpu_clock(void)
{
    extern uint32_t SystemCpuClock;
    return SystemCpuClock;
}

/**
 * @brief  set auto slow clock when cpu sleep
 * @param  enable or disable auto slow clock
 * @return none.
  */
void set_auto_slow_clock(bool enable)
{
    if (SYSBLKCTRL->u_200.BITS_200.r_cpu_slow_en != enable)
    {
        OTP->r_cpu_slow_en = enable;
        SYSBLKCTRL->u_200.BITS_200.r_cpu_slow_en = enable;
    }
}


/**
 * @brief  get 14 bytes EUID
 * @param  none
 * @return uint8_t *, the pointer to a copy of EUID.
  */
uint8_t *get_ic_euid(void)
{
    static uint8_t euid[15] = {0};

    memcpy(euid, (uint8_t *)0x202545, 14);
    return euid;
}

/**
 * @brief  get ic type
 * @param  none
 * @return uint8_t, ic type:
 * #define RTL8762DDF              0x59
 * #define RTL8762DKF              0x1A
 * #define RTL8762DGF              0x18
 * #define RTL8762DFA              0x2A
 * #define RTL8762DK               0x12
 * #define RTL8762DT               0x93
 * #define RTL8762DW               0x43
 * #define HQ624W                  0x73
 * #define RS624MF                 0x39
 */
uint8_t get_ic_type(void)
{
    return *(uint8_t *)0x00202543;
}


/** @} */ /* End of group SYSTEM_INIT_Exported_Functions */
/** @} */ /* End of group SYSTEM_INIT */



